Tekla Open API Reference for Tekla Structures 2025
RebarSplitter.SplitType Property
 Gets or sets the split type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarSplitter.SplitTypeEnum SplitType { get; set; }
Public Property SplitType As RebarSplitter.SplitTypeEnum
	Get
	Set
Property Value
Type: RebarSplitter.SplitTypeEnum
See Also
Reference
RebarSplitter Class
Tekla.Structures.Model Namespace